import { LanguageText } from "../types";

export const Chinese: LanguageText = {
  errors: {
    incomplete: "在提交前，请填写所有的问题",
    required: "这是一个必须回答的问题",
    ratingError: "每一列选择的回答，请不要超过一个",
  },
  displayText: {
    title: "Community Kitchens（社区厨房）客户调查",
    headerText:
      "感谢您填写Community Kitchens餐食调查。请您放心，您的个人数据将始终保密。您的意见反馈十分宝贵，对确保获得资金，从而向人们提供免费的餐食，十分重要。",
    submitText: "提交",
    headers: [
      "介绍一下您自己的情况",
      "住房和无障碍使用厨房设备 ",
      "健康和饮食 ",
      "食物偏好",
      "资源 ",
      "对餐食的反馈 ",
    ],
    requiredText: "* 代表您必须回答的问题",
    successHeader: "您已成功提交！",
    successText:
      "感谢您填写这项调查！我们将使用您提供的信息，改进我们的免费餐食项目。",
  },
  questions: [
    {
      question: "您属于哪个年龄段？",
      options: ["0-17", "18-26", "27-49", "50-59", "60-65", "70-75", "75+"],
    },
    {
      question: "您的种族和/或民族？",
      options: [
        "美国印第安人或阿拉斯加原住民",
        "亚裔",
        "黑人或非洲裔美国人",
        "西班牙裔或拉丁裔",
        "中东或北非后裔",
        "夏威夷或太平洋岛屿原住民",
        "白人",
        "更希望不回答",
      ],
    },
    {
      question: "您更希望使用哪种语言？",
      options: [
        "中文（粤语或普通话）",
        "英语",
        "西班牙语",
        "他加禄语",
        "越南语",
        "其他：",
      ],
    },
    { question: "您的邮政编码？", options: [] },
    {
      question: "您的家里住着几口人？",
      options: ["1", "2", "3", "4", "5+"],
    },
    {
      question: "您也为5岁以下的儿童获取餐食吗？",
      options: ["是", "否"],
    },
    {
      question:
        "您目前正经历无家可归或住房不稳定吗？这包括住在户外、车辆、临时庇护所、过渡性住房、睡别人家沙发，或无法可靠地无障碍使用厨房设施。",
      options: ["是", "否", "其他："],
    },
    {
      question: "您一般可以无障碍地使用哪些烹饪设备？所有适用的都选。",
      options: [
        "冰箱",
        "微波炉",
        "火炉/烤箱",
        "餐具（即：筷子、叉子、刀、勺子）",
        "以上都没有",
        "其他：",
      ],
    },
    {
      question: "您或您的家庭成员有任何以下健康问题吗？所有适用的都选。",
      options: [
        "食物过敏",
        "心脏病",
        "高血压",
        "出行不便",
        "I型糖尿病",
        "II型糖尿病",
        "其他",
        "无",
        "更希望不回答",
      ],
    },
    {
      question: "您有任何饮食偏好或限制吗？所有适用的都选。",
      options: [
        "对奶制品过敏/敏感",
        "不吃麸质",
        "犹太洁食认证/清真食品",
        "不吃牛肉",
        "不吃猪肉",
        "对坚果过敏/敏感",
        "吃鱼的素食者",
        "对贝类过敏/敏感",
        "吃素食/纯素",
        "无",
        "其他：",
      ],
    },
    {
      question: "在我们可提供的时候，您希望在餐食中包括新鲜水果或沙拉吗？",
      options: ["是", "否"],
    },
    {
      question: "对您喜欢的食物，按顺序排列（1 = 最喜欢，7 = 最不喜欢）",
      options: [
        "美式",
        "亚洲烹饪",
        "烧烤",
        "意大利风味",
        "墨西哥风味",
        "三明治",
        "南部州/Soul暖心家常",
      ],
    },
    {
      question: "您参加CalFresh项目了吗？如果没有，您希望获得协助参加吗？",
      options: [
        "是的，我已经参加了",
        "是的，我希望获得帮助参加",
        "没有，我不想参加",
        "没有，我最近失去了CalFresh福利",
      ],
    },
    {
      question: "以下哪些资源会对您有帮助？所有适用的都选。",
      options: [
        "儿童照护",
        "家庭暴力受害者资源",
        "干/罐头食品",
        "新鲜农产品",
        "健康保健",
        "寻找住房",
        "个人卫生用品套装或洗漱用品",
        "经期卫生用品",
        "做好的饭菜",
        "袜子",
        "物质滥用康复服务",
        "防水帆布和/或帐篷",
        "水",
        "其他：",
      ],
    },
    {
      question: "您会如何评价Community Kitchens的餐食？",
      options: ["非常好", "好", "还可以", "差", "我还没有尝试过"],
    },
    {
      question: "如果没有Community Kitchens的餐食，您需要饿肚子不吃饭的频率？",
      options: [
        "从来没有",
        "很少发生",
        "大约每周一次",
        "每周两三次",
        "一周超过三次",
      ],
    },
    {
      question: "您一般在哪里获得Community Kitchens的餐食？所有适用的都选。",
      options: [
        "从CK Central Kitchen的门店领取",
        "社区组织或伙伴的地点",
        "Town Fridges提供免费食物的冰箱",
        "其他：",
      ],
    },
    {
      question: "Community Kitchens的餐食帮助我获得更健康的食物。",
      options: ["强烈赞同", "赞同", "不赞同也不反对", "反对", "强烈反对"],
    },
  ],
};
